app/Controllers/Dashboard.php

    public function index()
    //ketika method index dipanggil maka akan menjalankan/mengembalikan sebuah view
    {
        // Ambil semua data produk
        $produk = $this->produkModel->findAll();

        // Ambil semua data produk
        $supplier = $this->supplierModel->findAll();
---
SELECT *
FROM `produk`
SELECT *
FROM `supplier`