app/Controllers/DetailPenjualan.php

SELECT `detail_penjualan`.*, `produk`.`kode_produk`, `produk`.`nama_produk`, `produk`.`harga_jual_sat`
FROM `detail_penjualan`
INNER JOIN `produk` ON `produk`.`kode_produk` = `detail_penjualan`.`kode_produk`
SELECT *
FROM `produk`
---
    public function index()
    {
        // Ambil semua data detailpenjualan

       $detailpenjualan = $this->detailpenjualanModel->select('detail_penjualan.*, produk.kode_produk, produk.nama_produk,
       produk.harga_jual_sat','produk.harga_jual_lsn', 'produk.harga_jual_krt')
       ->join('produk', 'produk.kode_produk = detail_penjualan.kode_produk', 'inner')
       ->findAll();

       $produk = $this->produkModel->findAll();