app/Models/DetailPenjualanModel.php

SELECT *
FROM `produk`
WHERE `kode_produk` = 'GRRB'
---
    public function getdetailproduk($kode_produk){
        return $this->db->table('produk')->where('kode_produk', $kode_produk)->get();